// Изменение интенсивности фильтров, применяемых к загружаемой через форму фотографии

/**
 *Задача

* TODO В этом задании мы продолжим реализацию сценария загрузки изображения и его редактирования на примере заглушки.

 * TODO  Напишите код, который позволит пользователю редактировать масштаб изображения. Кроме визуального применения эффекта необходимо записывать значение в поле формы с масштабом, доступное только для чтения, для дальнейшей отправки на сервер.

  * TODO  С помощью библиотеки noUiSlider (скрипт и стили находятся в директории /vendor/nouislider) реализуйте применение эффекта для изображения. Кроме визуального применения эффекта необходимо записывать значение в скрытое поле для дальнейшей отправки на сервер.

  * !  Обратите внимание, что при переключении фильтра, уровень эффекта должен сразу сбрасываться до начального состояния, т. е. логика по определению уровня насыщенности должна срабатывать не только при «перемещении» слайдера, но и при переключении фильтров.
 */
